podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/DMAMUX0_16CH_TRIG_MK64F12.svd.xml
<!--
Devices using this peripheral: 
      MK64F12
-->
      <peripheral>
         <?sourceFile "DMAMUX0_16CH_TRIG_MK64F12" ?>
         <name>DMAMUX0</name>
         <description>DMA channel multiplexor</description>
         <groupName>DMAMUX</groupName>
         <headerStructName>DMAMUX</headerStructName>
         <baseAddress>0x40021000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <?width "8" ?>
            <offset>0x0</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>16</dim>
               <dimIncrement>1</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>CHCFG%s</name>
               <description>Channel Configuration Register</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>SOURCE</name>
                     <description>DMA Channel Source (slot)\n
Specifies which DMA source, if any, is routed to a particular DMA channel</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>Disabled</name>
                           <description>Disable</description>
                           <value>0b000000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved1</name>
                           <description>Reserved</description>
                           <value>0b000001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UART0_Rx</name>
                           <description>UART0 Receive</description>
                           <value>0b000010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UART0_Tx</name>
                           <description>UART0 Transmit</description>
                           <value>0b000011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UART1_Rx</name>
                           <description>UART1 Receive</description>
                           <value>0b000100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UART1_Tx</name>
                           <description>UART1 Transmit</description>
                           <value>0b000101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UART2_Rx</name>
                           <description>UART2 Receive</description>
                           <value>0b000110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UART2_Tx</name>
                           <description>UART2 Transmit</description>
                           <value>0b000111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UART3_Rx</name>
                           <description>UART3 Receive</description>
                           <value>0b001000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UART3_Tx</name>
                           <description>UART3 Transmit</description>
                           <value>0b001001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UART4_RxTx</name>
                           <description>UART4_RxTx</description>
                           <value>0b001010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UART5_RxTx</name>
                           <description>UART5_RxTx</description>
                           <value>0b001011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>I2S0_Rx</name>
                           <description>I2S0 Receive</description>
                           <value>0b001100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>I2S0_Tx</name>
                           <description>I2S0 Transmit</description>
                           <value>0b001101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPI0_Rx</name>
                           <description>SPI0 Receive</description>
                           <value>0b001110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPI0_Tx</name>
                           <description>SPI0 Transmit</description>
                           <value>0b001111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPI1_RxTx</name>
                           <description>SPI1_RxTx</description>
                           <value>0b010000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPI2_RxTx</name>
                           <description>SPI2_RxTx</description>
                           <value>0b010001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>I2C0</name>
                           <description>I2C0</description>
                           <value>0b010010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>I2C1_I2C2</name>
                           <description>I2C1_I2C2</description>
                           <value>0b010011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM0_Ch0</name>
                           <description>FTM0 Channel 0</description>
                           <value>0b010100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM0_Ch1</name>
                           <description>FTM0 Channel 1</description>
                           <value>0b010101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM0_Ch2</name>
                           <description>FTM0 Channel 2</description>
                           <value>0b010110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM0_Ch3</name>
                           <description>FTM0 Channel 3</description>
                           <value>0b010111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM0_Ch4</name>
                           <description>FTM0 Channel 4</description>
                           <value>0b011000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM0_Ch5</name>
                           <description>FTM0 Channel 5</description>
                           <value>0b011001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM0_Ch6</name>
                           <description>FTM0 Channel 6</description>
                           <value>0b011010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM0_Ch7</name>
                           <description>FTM0 Channel 7</description>
                           <value>0b011011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM1_Ch0</name>
                           <description>FTM1 Channel 0</description>
                           <value>0b011100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM1_Ch1</name>
                           <description>FTM1 Channel 1</description>
                           <value>0b011101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM2_Ch0</name>
                           <description>FTM2 Channel 0</description>
                           <value>0b011110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM2_Ch1</name>
                           <description>FTM2 Channel 1</description>
                           <value>0b011111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM3_Ch0</name>
                           <description>FTM3 Channel 0</description>
                           <value>0b100000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM3_Ch1</name>
                           <description>FTM3 Channel 1</description>
                           <value>0b100001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM3_Ch2</name>
                           <description>FTM3 Channel 2</description>
                           <value>0b100010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM3_Ch3</name>
                           <description>FTM3 Channel 3</description>
                           <value>0b100011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM3_Ch4</name>
                           <description>FTM3 Channel 4</description>
                           <value>0b100100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM3_Ch5</name>
                           <description>FTM3 Channel 5</description>
                           <value>0b100101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM3_Ch6</name>
                           <description>FTM3 Channel 6</description>
                           <value>0b100110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FTM3_Ch7</name>
                           <description>FTM3 Channel 7</description>
                           <value>0b100111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC0</name>
                           <description>ADC0</description>
                           <value>0b101000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC1</name>
                           <description>ADC1</description>
                           <value>0b101001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CMP0</name>
                           <description>CMP0</description>
                           <value>0b101010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CMP1</name>
                           <description>CMP1</description>
                           <value>0b101011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CMP2</name>
                           <description>CMP2</description>
                           <value>0b101100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DAC0</name>
                           <description>DAC0</description>
                           <value>0b101101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DAC1</name>
                           <description>DAC1</description>
                           <value>0b101110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CMT</name>
                           <description>CMT</description>
                           <value>0b101111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PDB</name>
                           <description>PDB</description>
                           <value>0b110000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PortA</name>
                           <description>PortA</description>
                           <value>0b110001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PortB</name>
                           <description>PortB</description>
                           <value>0b110010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PortC</name>
                           <description>PortC</description>
                           <value>0b110011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PortD</name>
                           <description>PortD</description>
                           <value>0b110100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PortE</name>
                           <description>PortE</description>
                           <value>0b110101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IEEE1588_Timer0</name>
                           <description>IEEE1588_Timer0</description>
                           <value>0b110110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IEEE1588_Timer1</name>
                           <description>IEEE1588_Timer1</description>
                           <value>0b110111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IEEE1588_Timer2</name>
                           <description>IEEE1588_Timer2</description>
                           <value>0b111000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IEEE1588_Timer3</name>
                           <description>IEEE1588_Timer3</description>
                           <value>0b111001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AlwaysEnabled58</name>
                           <description>AlwaysEnabled58</description>
                           <value>0b111010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AlwaysEnabled59</name>
                           <description>AlwaysEnabled59</description>
                           <value>0b111011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AlwaysEnabled60</name>
                           <description>AlwaysEnabled60</description>
                           <value>0b111100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AlwaysEnabled61</name>
                           <description>AlwaysEnabled61</description>
                           <value>0b111101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AlwaysEnabled62</name>
                           <description>AlwaysEnabled62</description>
                           <value>0b111110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AlwaysEnabled63</name>
                           <description>AlwaysEnabled63</description>
                           <value>0b111111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRIG</name>
                     <description>DMA Channel Trigger Enable\n
Enables the periodic trigger capability for the triggered DMA channel</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Request directed routed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Periodic triggering enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENBL</name>
                     <description>DMA Channel Enable\n
Usually the Channel enable in the DMA is used in preference to this</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Channel disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Channel enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
